{"name": "Cranberry Salsa", "url": "https://raw.github.com/sinker/tacofancy/master/condiments/cranberry_salsa.md", "recipe": "Ingredients\n------------\n* 1 bag cranberries\n* 1 cup water\n* 3/4 cup sugar\n* half a small white onion (chopped)\n* 1 jalepeño, chopped small (remove seeds & wash for less heat)\n* 1 bunch cilantro (cut up)\n* 1 lime\n\nDirections\n-----------\n1. In a saucepan, get your water and sugar boiling, then add the cranberries. Boil until the cranberries pop (5-10 minutes), then take off heat, drain, and cool. They'll be slightly jelly-like, but you don't want them to disintegrate entirely, so watch them closely.\n\n2. While the cranberries are cooling, chop your white onion, your jalepeño and cilantro.\n\n3. Once your berries are cool, they'll probably have turned gooey. If there is still a bunch of water, drain it. But it's probably turned to jelly.\n\n4. Combine everything, and give a good squeeze of lime over the whole thing. As you combine, you'll notice that the cranberries just give up their shape entirely. Also: Don't wear your finest clothing when you do this--this shit _stains_.\n\n5. Make adjustments based on taste here. Your main variables are:\n\t* Sweet vs tangy. Default right now is tangy. Add more sugar for sweet.\n\t* Battling the overwhelmingness of the cranberries. You've got two things going with the cranberries here: flavor and texture. More onion will add more crunch to the whole thing, and help boost up the salsa-ness. Jalepeño is your heat adjustment--seeds are your friend. But the Cilantro is your big mover here: it helps to round out the sharpness of the cranberry. Lime also helps bring down the cranberry overload.\n\n\nOrange Cranberry Salsa Holographic Varient Cover\n------------------------------------------------\n\n* Go with half a cup of OJ and half a cup of water to boil your berries in.\n* Compliment the lime juice with a fresh squeezed orange and then *zest* that motherfucker right into the salsa\n\ntags: vegetarian, vegan\n", "slug": "cranberry_salsa", "uuid": "2f041846-64eb-11ea-820b-acde48001122"}