{"name": "Guacamole", "url": "https://raw.github.com/sinker/tacofancy/master/condiments/guacamole.md", "recipe": "This is pretty canonical stuff right here.\n\n* 1-2 ripe Hass avocados\n* half a lime\n* a clove or two of chopped garlic\n* some chopped white or yellow onion\n* salt\n* pepper\n* dry cayenne or red chile pepper powder\n* a jalapeño, if that's your thing\n* a small chopped tomato\n* a handful of chopped cilantro\n\nLook, here's how this works: First, you squeeze the lime juice into your nice little ceramic bowl. Then you add the garlic, onion, spices, peppers if you're heating it up, and then **walk away**.\n\nSeriously, walk away for a minute. Crack open a nice Negra Modelo and use a wedge of the other half of the lime in it. Back in your bowl, let the strong stuff marinate in that lime juice for a few minutes. It's cooking.\n\nOK, now that you're back, mix in the rest of the non-avocado ingredients. If you have a pestle, now's it's time to shine. If not, use a small wooden spoon, or failing all else, a fork, you miserable lout. \n\nMash up everything but the avocado. Get it pasty if you can. Squish it all up.\n\nNow you can add your avocado or two, dude. I usually go with about 1.5 avos to condiment tacos or taco-like structures for four humans of varying sizes.\n\nJust in case no one ever taught you how to deal with an avocado correctly, here's a quick lesson:\n* Cut it in half, longways.\n* Smack the pit with the sharp edge of your knife and give it a sensible 90-degree twist.\n* Voila, the avocado pit is on your knife.\n* Dispose of it, unless you're not going to finish all that guac now, in which case, hang onto it and put it in the bowl with the guac before you put it in the fridge.\n* Now that your knife is free, use it to carve long slices into the flesh of your avocado, one half at a time. Cross-hatch that sucker a bit. Don't cut through the flesh.\n* Finally, get your avocado half above your nice bowl full of deliciousness, and use the skin to gently push your nice slices into the spicy soup below. Turn it inside-out, if you must, but know that you can minimize the amount of avocado that gets all over your hands if you do this just right.\n\nTo finish up your guacamole, mash your avocado up a bit and gently mix it into the magical citric-spice-tomato concoction. We're done here.\n\n_Thanks to [The Awl](http://www.theawl.com/2010/02/half-baked-guacamole-by-the-ceviche-method) for limited inspiration regarding the limey and drinky parts._\n\ntags: vegetarian\n", "slug": "guacamole"}