{"name": "Pickled Red Onions", "url": "https://raw.github.com/sinker/tacofancy/master/condiments/pickled_red_onions.md", "recipe": "My wife made this recipe up, after eating something similar, but if you are making brisket tacos, it is the most wonderful accessory:\n\n__Ingredients__\n\n* Vinegar\n* 2 chopped red onions\n* 1 tablespoon of sugar\n* a dash of chili powder\n\nChop the red onions into rings and put them into a container of vinegar. Add the sugar and store the mixture in your refrigerator to marinate and pickle, the longer the better.\n\nPick out the rings and place them on your brisket taco. Eat.\n\nVariations\n----------\n\nPickled onions are a favorite in the Von Doom house, too. [@littlewhirl](http://twitter.com/littlewhirl) played around with a similar starting point and we use this brine instead:\n\n* 1/2 cup apple cider vinegar\n* 1 T Sugar (I usually use coconut palm sugar because I'm a hippie I guess)\n* Water\n* 1 1/2 tsp salt\n* 1 sprig fresh oregano and/or cilantro (optional)\n\nSlice 1 red onion on a mandolin (WORTH IT). In a bowl melt the sugar and salt with some warm/hot water. Add vinegar and 1c of filtered water.\nAdd in onion, top off w/ water so that the onion is just covered.\nVERY IMPORTANT: Let sit at room temp for at least an hour. Trust me.\n\nThe apple cider vinegar is a tangier but also more subtle, keeping more of the onion flavor there. And using a partial salt water brine lets it work nice for quick pickles, but also for slightly longer engagements. Leading to the most important aspect:\n\nPICKLE ALL THE THINGS\n---------------------\n\nSeriously. All the things. Pickle your fridge. Pickle your waffles. Make. Lots. Of. Pickles.\n\n* __Cabbage__ — red or green work. You only need an hour or so (like onions)\n* __Jalepeños__ — seriously GTFO these are good. Add dill for a twist. Add parboiled carrots if you want to cut the spice\n* __Greenbeans__ — because greenbeans are goddam delicious\n* __Toy cars — kid with an attitude? Pickle their favorite toy car. Let's see them try to cop a tude when their matchbox cars are soggy and briney\n* __Cauliflower__ — personal favorite. Pickles in an hour, super delicious\n* __Baby corn__ — baby corn is gross, but if you pickle it you can make jokes about how big all the other things you pickled are\n\ntags: vegetarian, vegan\n", "slug": "pickled_red_onions"}