{"name": "Salsa de chile de árbol", "url": "https://raw.github.com/sinker/tacofancy/master/condiments/chile_de_arbol_sauce.md", "recipe": "This is a go-to taco sauce in western Mexico and probably elsewhere. You can\nmix and match the techniques in the two variants presented here, and substituting\nor adding chiles is a ramp onto the combinatorial superhighway of Mexican food and\ncan demystify the salsa bar at the local taquería.\n\n# Red\n\n* dried whole *chiles de árbol*\n* tomatoes\n* onion\n* *optionally*, garlic\n\nTake between .3 and 1 chiles per tomato, remove the stems and put them in a\nsaucepan with a tablespoon or two of oil (olive, soy, etc.) The pan and oil should be very\nhot and the chiles should seem to be at risk of burning. Rotate the\nchiles around and let them get dark brown to black without actually burning them —\nthis can happen quickly, which is good because your eyes, nose, and lungs\nmay reach their maximum vaporized chile tolerance during this step.\n\nAdd a bunch of chopped onion and garlic and lower the heat. Cut the tomatoes\nin half and throw them in with salt to taste. Cook until the tomatoes look stewed.\nIf you have one of those blender wands that you can put directly in a saucepan,\nyou can blend everything now (you may end up making this sauce frequently enough\nto justify the purchase of a blender wand.) Otherwise wait until the mixture\nis not hot and blend it in a standard blender.\n\n# Green\n\n* dried whole *chiles de árbol*\n* green tomatillos\n* onion\n* cilantro\n\nTake between .1 and .5 chiles per tomatillo, remove the stems and put them in a bare, hot saucepan.\nToast the chiles without oil until they are dark. Add halved or quartered tomatillos, salt, and a\ntablespoon or two of water to prevent burning the chiles before the tomatillos release\ntheir juices. When the mixture has cooked for as long as you can stand to wait, remove\nthe heat and let it cool. Blend and place in a little salsa bowl and heap with finely\nchopped onion and cilantro.\n\nOne non-obvious little point is that skipping the oil in the chile roasting-toasting\nstep seems to increase the spiciness of the final product.\n\ntags: vegetarian\n", "slug": "salsa_de_chile_de_arbol", "uuid": "2f03a532-64eb-11ea-820b-acde48001122"}